TestingTool_3-0/src/InformationRegisters/ПеременныеЗаданий/ПеременныеЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПеременныеЗаданий</name>
  <resources>
    <name>ЗначениеПеременной</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьФункцию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоПараметрНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>CatalogRef.ДействияЗаданий</types>
      <types>CatalogRef.Задания</types>
      <types>CatalogRef.Тесты</types>
      <types>CatalogRef.ТестируемыеКлиенты</types>
      <types>CatalogRef.ШаблоныКоманд</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Релизы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяПеременной</name>
    <type>
      <types>CatalogRef.ИменаПеременных</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерАргумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <comment>внутренний ключ, используется при выполнении заданий</comment>
    <type>
      <types>CatalogRef.АгентыТестирования</types>
      <types>CatalogRef.Тесты</types>
      <types>CatalogRef.ТестируемыеКлиенты</types>
      <types>String</types>
      <types>Number</types>
      <types>CatalogRef.Проверки</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/InformationRegisters/СоставЗаданий/СоставЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставЗаданий</name>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>CatalogRef.Задания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядокВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодчиненноеЗадание</name>
    <type>
      <types>CatalogRef.Задания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действие</name>
    <type>
      <types>CatalogRef.ДействияЗаданий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/Catalogs/ШаблоныКоманд/ШаблоныКоманд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныКоманд</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТекстШаблона</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКонструктора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьКонструктором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

TestingTool_3-0/src/Catalogs/ДействияЗаданий/ДействияЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДействияЗаданий</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Архив</name>
      <description>Архив</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Служебные</description>
    </items>
  </predefined>
  <attributes>
    <name>Каталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработка</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыеАдреса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДействия</name>
    <type>
      <types>EnumRef.ТипыДействийЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>КоманднаяСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Код1С</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Время</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Интервал</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоявлениеФайла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствиеФайла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Алгоритм</name>
    <type>
      <types>CatalogRef.Алгоритмы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПроцедурыОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелоПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКомандуПлатформыЗапуститьПриложение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКоманды</name>
    <type>
      <types>CatalogRef.ШаблоныКоманд</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьШаблонКоманды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАлгоритм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКонструктора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьКонструктором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьОтдельнымФоновымЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

TestingTool_3-0/src/Catalogs/Задания/Задания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задания</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Архив</name>
      <description>Архив</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Служебные</description>
    </items>
  </predefined>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЗадания</name>
    <type>
      <types>CatalogRef.ГруппыЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПеременныеПоЗавершению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПроверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКонструктора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьКонструктором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестируемыйКлиент</name>
    <type>
      <types>CatalogRef.ТестируемыеКлиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаГорлышка</name>
    <comment>Максимальное одновременное количество заданий в работе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботы</name>
    <type>
      <types>EnumRef.РежимыРаботыЗаданий</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestingTool_3-0/src/CommonModules/КонструкторЗаданийСервер/Module.bsl
#Область РаботаСПараметрами

// Процедура - Создать/обновить параметр
//  Создает или обновляет настройку парамтера. Для служебных параметров, которые предназначены только для определения использования в редакторе, 
//  используйте опцию (ЭтоПараметрНастройки=Истина)
Процедура УстановитьПараметр(Знач Владелец, Знач ИмяПеременной, Знач ЗначениеПеременной, Знач ЭтоПараметрНастройки=Истина, ОписаниеСвойств=Неопределено ) Экспорт
	
	Ключ = Неопределено;
	НомерАргумента = 0;
	ИмяРеквизита = "";
	ИмяФункции = "";
	
	Если ТипЗнч(ОписаниеСвойств)=Тип("Структура") Тогда
		ОписаниеСвойств.Свойство("Ключ",Ключ);
		ОписаниеСвойств.Свойство("НомерАргумента",НомерАргумента);
		ОписаниеСвойств.Свойство("ИмяРеквизита",ИмяРеквизита);
		ОписаниеСвойств.Свойство("ИмяФункции",ИмяФункции);
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ПеременныеЗаданий.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Задание 					= Владелец;	
	МенеджерЗаписи.ИмяПеременной 			= ИмяПеременной;
	МенеджерЗаписи.НомерАргумента 			= НомерАргумента;
	МенеджерЗаписи.Ключ 					= Ключ;
	МенеджерЗаписи.ЗначениеПеременной 		= ЗначениеПеременной;
	МенеджерЗаписи.ЭтоПараметрНастройки 	= ЭтоПараметрНастройки;
	МенеджерЗаписи.ИмяРеквизита 			= ИмяРеквизита;
	Если ЗначениеЗаполнено(ИмяФункции) Тогда
		МенеджерЗаписи.ИмяФункции 			= ИмяФункции;
		МенеджерЗаписи.ИспользоватьФункцию 	= Истина;
	КонецЕсли;
	
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры


// Возвращает значение переменной
Функция  ПолучитьЗначениеПараметра(Знач Владелец, Знач ИмяПеременной, Знач ЭтоПараметрНастройки=Истина, Знач Ключ=Неопределено)  Экспорт
	
	ЗначениеПараметра = Неопределено;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПеременныеЗаданий.ЗначениеПеременной КАК Значение
	|ИЗ
	|	РегистрСведений.ПеременныеЗаданий КАК ПеременныеЗаданий
	|ГДЕ
	|	ПеременныеЗаданий.Задание = &Задание
	|	И ПеременныеЗаданий.ИмяПеременной = &ИмяПеременной
	|	И ПеременныеЗаданий.ЭтоПараметрНастройки = &ЭтоПараметрНастройки
	|	И ПеременныеЗаданий.Ключ = &Ключ";
	Запрос.УстановитьПараметр("Задание",Владелец);
	Запрос.УстановитьПараметр("ИмяПеременной",ИмяПеременной);
	Запрос.УстановитьПараметр("ЭтоПараметрНастройки",ЭтоПараметрНастройки);
	Запрос.УстановитьПараметр("Ключ",Ключ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗначениеПараметра = Выборка.Значение;
	КонецЕсли;

	Возврат ЗначениеПараметра;
	
КонецФункции

#КонецОбласти


#Область РаботаСШаблонами

// Создаем шаблон
Функция СоздатьШаблонКоманды(Знач ИдентификаторКонструктора, Знач Наименование, Знач КлючПоиска, Знач ТекстШаблона) Экспорт
	
	ШаблонСсылка = Справочники.ШаблоныКоманд.ПустаяСсылка();
	
	ШаблонОбъект = Справочники.ШаблоныКоманд.СоздатьЭлемент();
	ШаблонОбъект.Наименование 				= Наименование;
	ШаблонОбъект.ИдентификаторКонструктора 	= ИдентификаторКонструктора;
	ШаблонОбъект.ТекстШаблона 				= ТекстШаблона;
	ШаблонОбъект.РедактироватьКонструктором = Истина;
	
	ШаблонОбъект.Записать();
	ШаблонСсылка = ШаблонОбъект.Ссылка;
	
	Возврат ШаблонСсылка;
КонецФункции

// Найти шблон
Функция НайтиШаблонКоманды(Знач ИдентификаторКонструктора,Знач ТекстШаблона="",Знач КлючПоиска="") Экспорт
	
	ШаблонСсылка = Справочники.ШаблоныКоманд.ПустаяСсылка();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	0 КАК Порядок
	|ИЗ
	|	РегистрСведений.ПеременныеЗаданий КАК ПеременныеЗаданий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШаблоныКоманд КАК Т
	|		ПО ПеременныеЗаданий.Задание = Т.Ссылка
	|			И (ПеременныеЗаданий.НомерАргумента = 0)
	|			И (ПеременныеЗаданий.Ключ = НЕОПРЕДЕЛЕНО)
	|			И (ПеременныеЗаданий.ИмяПеременной = &ИмяПеременной)
	|			И (ПеременныеЗаданий.ЗначениеПеременной = &КлючПоиска)
	|ГДЕ
	|	Т.ИдентификаторКонструктора = &ИдентификаторКонструктора
	|	И Т.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка,
	|	1
	|ИЗ
	|	Справочник.ШаблоныКоманд КАК Т
	|ГДЕ
	|	Т.ПометкаУдаления = ЛОЖЬ
	|	И (ВЫРАЗИТЬ(Т.ТекстШаблона КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(&ТекстШаблона КАК СТРОКА(1000)))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	Запрос.УстановитьПараметр("ИдентификаторКонструктора",ИдентификаторКонструктора);
	Запрос.УстановитьПараметр("ИмяПеременной",Справочники.ИменаПеременных.КлючПоиска);
	Запрос.УстановитьПараметр("КлючПоиска",КлючПоиска);
	Запрос.УстановитьПараметр("ТекстШаблона",ТекстШаблона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ШаблонСсылка = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ШаблонСсылка;
КонецФункции

#КонецОбласти


#Область РаботаСДействиями

// Создаем действие задания
Функция СоздатьДействиеЗадания(Знач ИдентификаторКонструктора, Знач СвойстваЗадания) Экспорт
	
	ДействиеСсылка = Справочники.ДействияЗаданий.ПустаяСсылка();
	
	Если ТипЗнч(СвойстваЗадания)=Тип("Структура") Тогда
		
		ДействиеОбъект = Справочники.ДействияЗаданий.СоздатьЭлемент();
		
		// по умолчанию заполним
		ДействиеОбъект.ИдентификаторКонструктора 	= ИдентификаторКонструктора;
		ДействиеОбъект.РедактироватьКонструктором	= Истина;
		ДействиеОбъект.Автор						= Пользователи.ТекущийПользователь();
		
		// перезаполним из структуры
		ЗаполнитьЗначенияСвойств(ДействиеОбъект,СвойстваЗадания);
		
		ДействиеОбъект.Записать();
		ДействиеСсылка = ДействиеОбъект.Ссылка;
	Иначе
		
		ВызватьИсключение "Ожидается структура 'СвойстваЗадания', а передены не верные данные!";
		
	КонецЕсли;

	Возврат ДействиеСсылка;
КонецФункции


Функция НайтиДействиеЗадания(Знач ИдентификаторКонструктора, Знач КлючПоиска) Экспорт
	
	ДействиеСсылка = Справочники.ШаблоныКоманд.ПустаяСсылка();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	0 КАК Порядок
	|ИЗ
	|	РегистрСведений.ПеременныеЗаданий КАК ПеременныеЗаданий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДействияЗаданий КАК Т
	|		ПО ПеременныеЗаданий.Задание = Т.Ссылка
	|			И (ПеременныеЗаданий.НомерАргумента = 0)
	|			И (ПеременныеЗаданий.Ключ = НЕОПРЕДЕЛЕНО)
	|			И (ПеременныеЗаданий.ИмяПеременной = &ИмяПеременной)
	|			И (ПеременныеЗаданий.ЗначениеПеременной = &КлючПоиска)
	|ГДЕ
	|	Т.ИдентификаторКонструктора = &ИдентификаторКонструктора
	|	И Т.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	Запрос.УстановитьПараметр("ИдентификаторКонструктора",ИдентификаторКонструктора);
	Запрос.УстановитьПараметр("ИмяПеременной",Справочники.ИменаПеременных.КлючПоиска);
	Запрос.УстановитьПараметр("КлючПоиска",КлючПоиска);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ДействиеСсылка = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ДействиеСсылка;
КонецФункции


#КонецОбласти


#Область РаботаССоставомЗаданий

// Очищаем полностью состав заданий
Процедура ОчиститьСоставЗаданий(Знач Задание) Экспорт
	
	НаборЗаписей = РегистрыСведений.СоставЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задание.Установить(Задание);
	НаборЗаписей.Записать(Истина);	
	
КонецПроцедуры

// добавить действие в состав заданий
Процедура ДобавитьВСоставЗаданий(Знач Задание, Знач Действие, Знач ПорядокВыполнения, Знач ПодчиненноеЗадание=Неопределено) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СоставЗаданий.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Задание 					= Задание;	
	МенеджерЗаписи.Действие 				= Действие;
	МенеджерЗаписи.ПорядокВыполнения 		= ПорядокВыполнения;
	МенеджерЗаписи.ПодчиненноеЗадание 		= ПодчиненноеЗадание;
	
	МенеджерЗаписи.Записать(Истина);	
	
КонецПроцедуры

#КонецОбласти


#Область РаботаСЗаданиями

Функция СоздатьОбновитьЗадание(Знач Задание, Знач СвойстваЗадания)  Экспорт
	
	Если ЗначениеЗаполнено(Задание) Тогда
		ЗаданиеОбъект = Задание.ПолучитьОбъект();
	Иначе
		ЗаданиеОбъект = Справочники.Задания.СоздатьЭлемент();
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(ЗаданиеОбъект, СвойстваЗадания);
	
	Если НЕ ЗначениеЗаполнено(ЗаданиеОбъект.Автор) Тогда
		ЗаданиеОбъект.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ЗаданиеОбъект.Записать();
	
	Возврат ЗаданиеОбъект.Ссылка;
КонецФункции

Функция НайтиЗаданиеПоID(Знач ID,Знач Задание=Неопределено) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Задания.Ссылка
	|ИЗ
	|	Справочник.Задания КАК Задания
	|ГДЕ
	|	Задания.ID = &ID
	|	И Задания.Ссылка <> &Задание";
	Запрос.УстановитьПараметр("ID",ID);
	Запрос.УстановитьПараметр("Задание",Задание);

	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Справочники.Задания.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#Область Разное

Функция ПолучитьПортАдресаИнтернет(Знач АдресИнтернет,Знач ПоУмолчанию=80) Экспорт
	Порт = ПоУмолчанию;
	АдресИнтернет = СтрЗаменить(АдресИнтернет,"http://","");
	АдресИнтернет = СтрЗаменить(АдресИнтернет,"https://","");
	ПозицияДвоеточия = Найти(АдресИнтернет,":");
	Если ПозицияДвоеточия<>0 Тогда
		АдресИнтернет = СокрЛП(АдресИнтернет);
		ПортСтр = "";
		Для ш=ПозицияДвоеточия+1 по СтрДлина(АдресИнтернет) Цикл
			ТекСимвол = Сред(АдресИнтернет,ш,1);
			Если Найти("0123456789",ТекСимвол) Тогда
				ПортСтр = ПортСтр+ТекСимвол;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Попытка 
			Порт = XMLСтрока(Число(ПортСтр));
		Исключение
			ЗаписьЖурналаРегистрации("Введенный адрес интернет ("+АдресИнтернет+") не корректный (шаблон:'http://localhost:8080')");
		КонецПопытки;
	КонецЕсли;
	Возврат Порт;
КонецФункции

#КонецОбласти
